# Лучше использовать второй вариант, так как первый вариант работает с ссылками
# одного и того же списка и в случае изменения одного внутреннего списка
# точно так же будут изменены остальные списки.

# Инициализация списка -- метод 1
x = [[1, 2, 3, 4]] * 3
# [[1, 2, 3, 4], [1, 2, 3, 4], [1, 2, 3, 4]]

# Инициализация списка -- метод 2
y = [[1, 2, 3, 4] for _ in range(3)]
# [[1, 2, 3, 4], [1, 2, 3, 4], [1, 2, 3, 4]]

print(x, type(x))
print(y, type(y))

x[0][0] = 9
y[0][0] = 9

print(x, type(x))
print(y, type(y))
